In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt
# !pip install missingno
import missingno as msno
from datetime import date
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split
from sklearn.neighbors import LocalOutlierFactor
from sklearn.preprocessing import MinMaxScaler, LabelEncoder, StandardScaler, RobustScaler

pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)
pd.set_option('display.float_format', lambda x: '%.3f' % x)
pd.set_option('display.width', 500)

def load():
    data = pd.read_csv("titanic.csv")
    return data

def load_application_train():
    data = pd.read_csv("application_train.csv")
    return data
df = load()
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S

### Label Encoding & Binary Encoding

In [2]:
le = LabelEncoder()
le.fit_transform(df["Sex"])[0:5]

array([1, 0, 0, 0, 1])

In [3]:
def label_encoder(dataframe,binary_col):
    le= LabelEncoder()
    dataframe[binary_col] = le.fit_transform(dataframe[binary_col])
    return dataframe

In [4]:
binary_col = [col for col in df.columns if df[col].dtype not in [int,float] and df[col].nunique() == 2]

In [5]:
for col in binary_col:
    label_encoder(df,col)

In [6]:
df.head(3)

   PassengerId  Survived  Pclass                                               Name  Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    1 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...    0 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina    0 26.000      0      0  STON/O2. 3101282  7.925   NaN        S

In [7]:
df = load_application_train()
df.shape

(307511, 122)

In [8]:
binary_col = [col for col in df.columns if df[col].dtype not in [int,float] and df[col].nunique() == 2]
binary_col

['TARGET',
 'NAME_CONTRACT_TYPE',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'EMERGENCYSTATE_MODE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21']

In [9]:
df[binary_col].head()

,TARGET,NAME_CONTRACT_TYPE,FLAG_OWN_CAR,FLAG_OWN_REALTY,FLAG_MOBIL,FLAG_EMP_PHONE,FLAG_WORK_PHONE,FLAG_CONT_MOBILE,FLAG_PHONE,FLAG_EMAIL,REG_REGION_NOT_LIVE_REGION,REG_REGION_NOT_WORK_REGION,LIVE_REGION_NOT_WORK_REGION,REG_CITY_NOT_LIVE_CITY,REG_CITY_NOT_WORK_CITY,LIVE_CITY_NOT_WORK_CITY,EMERGENCYSTATE_MODE,FLAG_DOCUMENT_2,FLAG_DOCUMENT_3,FLAG_DOCUMENT_4,FLAG_DOCUMENT_5,FLAG_DOCUMENT_6,FLAG_DOCUMENT_7,FLAG_DOCUMENT_8,FLAG_DOCUMENT_9,FLAG_DOCUMENT_10,FLAG_DOCUMENT_11,FLAG_DOCUMENT_12,FLAG_DOCUMENT_13,FLAG_DOCUMENT_14,FLAG_DOCUMENT_15,FLAG_DOCUMENT_16,FLAG_DOCUMENT_17,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21
0,1,Cash loans,N,Y,1,1,0,1,1,0,0,0,0,0,0,0,No,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,Cash loans,N,N,1,1,0,1,1,0,0,0,0,0,0,0,No,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,0,Revolving loans,Y,Y,1,1,1,1,1,0,0,0,0,0,0,0,NaN,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3,0,Cash loans,N,Y,1,1,0,1,0,0,0,0,0,0,0,0,NaN,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,0,Cash loans,N,Y,1,1,0,1,0,0,0,0,0,0,1,1,NaN,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0

In [10]:
for col in binary_col:
    label_encoder(df,col)

In [11]:
df[binary_col].head()

,TARGET,NAME_CONTRACT_TYPE,FLAG_OWN_CAR,FLAG_OWN_REALTY,FLAG_MOBIL,FLAG_EMP_PHONE,FLAG_WORK_PHONE,FLAG_CONT_MOBILE,FLAG_PHONE,FLAG_EMAIL,REG_REGION_NOT_LIVE_REGION,REG_REGION_NOT_WORK_REGION,LIVE_REGION_NOT_WORK_REGION,REG_CITY_NOT_LIVE_CITY,REG_CITY_NOT_WORK_CITY,LIVE_CITY_NOT_WORK_CITY,EMERGENCYSTATE_MODE,FLAG_DOCUMENT_2,FLAG_DOCUMENT_3,FLAG_DOCUMENT_4,FLAG_DOCUMENT_5,FLAG_DOCUMENT_6,FLAG_DOCUMENT_7,FLAG_DOCUMENT_8,FLAG_DOCUMENT_9,FLAG_DOCUMENT_10,FLAG_DOCUMENT_11,FLAG_DOCUMENT_12,FLAG_DOCUMENT_13,FLAG_DOCUMENT_14,FLAG_DOCUMENT_15,FLAG_DOCUMENT_16,FLAG_DOCUMENT_17,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21
0,1,0,0,1,1,1,0,1,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,1,1,0,1,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3,0,0,0,1,1,1,0,1,0,0,0,0,0,0,0,0,2,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,0,0,0,1,1,1,0,1,0,0,0,0,0,0,1,1,2,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0

In [12]:
df = load()
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S

In [13]:
df["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [14]:
pd.get_dummies(df,columns=["Embarked"]).head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin  Embarked_C  Embarked_Q  Embarked_S
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN           0           0           1
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85           1           0           0
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN           0           0           1
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123           0           0           1
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN           0           0           1

In [15]:
pd.get_dummies(df,columns=["Embarked"],drop_first=True).head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin  Embarked_Q  Embarked_S
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN           0           1
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85           0           0
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN           0           1
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123           0           1
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN           0           1

In [16]:
def one_hot_encoder(dataframe,columns,drop_first=True):
    dataframe= pd.get_dummies(dataframe,columns=[columns],drop_first=drop_first).head()
    return dataframe

In [17]:
one_hot_encoder(df,"Sex")

   PassengerId  Survived  Pclass                                               Name    Age  SibSp  Parch            Ticket   Fare Cabin Embarked  Sex_male
0            1         0       3                            Braund, Mr. Owen Harris 22.000      1      0         A/5 21171  7.250   NaN        S         1
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th... 38.000      1      0          PC 17599 71.283   C85        C         0
2            3         1       3                             Heikkinen, Miss. Laina 26.000      0      0  STON/O2. 3101282  7.925   NaN        S         0
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel) 35.000      1      0            113803 53.100  C123        S         0
4            5         0       3                           Allen, Mr. William Henry 35.000      0      0            373450  8.050   NaN        S         1

In [18]:
df = load()

In [19]:
def grab_col_name(dataframe,cat_th=10,car_th=20):
    cat_cols    =  [col for col in dataframe.columns if dataframe[col].dtype == ("O")]
    num_but_cat =  [col for col in dataframe.columns if dataframe[col].nunique() < cat_th and dataframe[col].dtype !="O"]
    cat_but_car =  [col for col in dataframe.columns if dataframe[col].nunique() < car_th and dataframe[col].dtype == "O"]
    cat_cols = cat_cols + num_but_cat
    cat_cols = [col for col in cat_cols if col not in cat_but_car]
    num_cols = [col for col in dataframe.columns if dataframe[col].dtype !="O"]
    num_cols = [col for col in num_cols if col not in num_but_cat]
    print(f"observations:{dataframe.shape[0]}")
    print(f"variables:{dataframe.shape[1]}")
    print(f'cat_cols:{len(cat_cols)}')
    print(f'num_cols:{len(num_cols)}')
    print(f'cat_but_car:{len(cat_but_car)}')
    print(f'num_but_car:{len(num_but_cat)}')
    return cat_cols,num_cols,cat_but_car

In [20]:
cat_cols,num_cols,cat_but_car = grab_col_name(df)

observations:891
variables:12
cat_cols:7
num_cols:3
cat_but_car:2
num_but_car:4

In [21]:
ohe_cols = [col for col in df.columns if 10 >= df[col].nunique()>2]

In [22]:
for col in ohe_cols:
 print(one_hot_encoder(df,col).head(),"\n")

   PassengerId  Survived                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked  Pclass_2  Pclass_3
0            1         0                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S         0         1
1            2         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C         0         0
2            3         1                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S         0         1
3            4         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S         0         0
4            5         0                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S         0         1

   PassengerId  Survived  Pclass                                               Name     Sex    Age  Parch            Ticket   Fare Cabin Embarked  SibSp_1  SibSp_2  SibSp_3  SibSp_4  SibSp_5  SibSp_8
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      0         A/5 21171  7.250   NaN        S        1        0        0        0        0        0
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      0          PC 17599 71.283   C85        C        1        0        0        0        0        0
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0  STON/O2. 3101282  7.925   NaN        S        0        0        0        0        0        0
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      0            113803 53.100  C123        S        1        0        0        0        0        0
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0            373450  8.050   NaN        S        0        0        0        0        0        0

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp            Ticket   Fare Cabin Embarked  Parch_1  Parch_2  Parch_3  Parch_4  Parch_5  Parch_6
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1         A/5 21171  7.250   NaN        S        0        0        0        0        0        0
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1          PC 17599 71.283   C85        C        0        0        0        0        0        0
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0  STON/O2. 3101282  7.925   NaN        S        0        0        0        0        0        0
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1            113803 53.100  C123        S        0        0        0        0        0        0
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0            373450  8.050   NaN        S        0        0        0        0        0        0

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin  Embarked_Q  Embarked_S
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN           0           1
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85           0           0
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN           0           1
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123           0           1
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN           0           1

In [23]:
df = load_application_train()

In [24]:
df["NAME_EDUCATION_TYPE"].value_counts()

Secondary / secondary special    218391
Higher education                  74863
Incomplete higher                 10277
Lower secondary                    3816
Academic degree                     164
Name: NAME_EDUCATION_TYPE, dtype: int64

In [25]:
cat_cols,num_cols,cat_but_car=grab_col_name(df)

observations:307511
variables:122
cat_cols:40
num_cols:67
cat_but_car:15
num_but_car:39

In [26]:
cat_cols

['ORGANIZATION_TYPE',
 'TARGET',
 'FLAG_MOBIL',
 'FLAG_EMP_PHONE',
 'FLAG_WORK_PHONE',
 'FLAG_CONT_MOBILE',
 'FLAG_PHONE',
 'FLAG_EMAIL',
 'REGION_RATING_CLIENT',
 'REGION_RATING_CLIENT_W_CITY',
 'REG_REGION_NOT_LIVE_REGION',
 'REG_REGION_NOT_WORK_REGION',
 'LIVE_REGION_NOT_WORK_REGION',
 'REG_CITY_NOT_LIVE_CITY',
 'REG_CITY_NOT_WORK_CITY',
 'LIVE_CITY_NOT_WORK_CITY',
 'DEF_60_CNT_SOCIAL_CIRCLE',
 'FLAG_DOCUMENT_2',
 'FLAG_DOCUMENT_3',
 'FLAG_DOCUMENT_4',
 'FLAG_DOCUMENT_5',
 'FLAG_DOCUMENT_6',
 'FLAG_DOCUMENT_7',
 'FLAG_DOCUMENT_8',
 'FLAG_DOCUMENT_9',
 'FLAG_DOCUMENT_10',
 'FLAG_DOCUMENT_11',
 'FLAG_DOCUMENT_12',
 'FLAG_DOCUMENT_13',
 'FLAG_DOCUMENT_14',
 'FLAG_DOCUMENT_15',
 'FLAG_DOCUMENT_16',
 'FLAG_DOCUMENT_17',
 'FLAG_DOCUMENT_18',
 'FLAG_DOCUMENT_19',
 'FLAG_DOCUMENT_20',
 'FLAG_DOCUMENT_21',
 'AMT_REQ_CREDIT_BUREAU_HOUR',
 'AMT_REQ_CREDIT_BUREAU_DAY',
 'AMT_REQ_CREDIT_BUREAU_WEEK']

In [27]:
def cat_summary(dataframe,col_name,plot=False):
    print("#####################################")
    print(pd.DataFrame({col_name: dataframe[col_name].value_counts(),
                         "ratio": 100* dataframe[col_name].value_counts()/len(dataframe)}))
    print("#####################################")
    if plot:
        sns.countplot(x=dataframe[col_name],data=dataframe)
        plt.show()

In [28]:
for col in cat_cols:
    cat_summary(df,col)

#####################################
                        ORGANIZATION_TYPE  ratio
Business Entity Type 3              67992 22.110
XNA                                 55374 18.007
Self-employed                       38412 12.491
Other                               16683  5.425
Medicine                            11193  3.640
Business Entity Type 2              10553  3.432
Government                          10404  3.383
School                               8893  2.892
Trade: type 7                        7831  2.547
Kindergarten                         6880  2.237
Construction                         6721  2.186
Business Entity Type 1               5984  1.946
Transport: type 4                    5398  1.755
Trade: type 3                        3492  1.136
Industry: type 9                     3368  1.095
Industry: type 3                     3278  1.066
Security                             3247  1.056
Housing                              2958  0.962
Industry: type 11                    2704  0.879
Military                             2634  0.857
Bank                                 2507  0.815
Agriculture                          2454  0.798
Police                               2341  0.761
Transport: type 2                    2204  0.717
Postal                               2157  0.701
Security Ministries                  1974  0.642
Trade: type 2                        1900  0.618
Restaurant                           1811  0.589
Services                             1575  0.512
University                           1327  0.432
Industry: type 7                     1307  0.425
Transport: type 3                    1187  0.386
Industry: type 1                     1039  0.338
Hotel                                 966  0.314
Electricity                           950  0.309
Industry: type 4                      877  0.285
Trade: type 6                         631  0.205
Industry: type 5                      599  0.195
Insurance                             597  0.194
Telecom                               577  0.188
Emergency                             560  0.182
Industry: type 2                      458  0.149
Advertising                           429  0.140
Realtor                               396  0.129
Culture                               379  0.123
Industry: type 12                     369  0.120
Trade: type 1                         348  0.113
Mobile                                317  0.103
Legal Services                        305  0.099
Cleaning                              260  0.085
Transport: type 1                     201  0.065
Industry: type 6                      112  0.036
Industry: type 10                     109  0.035
Religion                               85  0.028
Industry: type 13                      67  0.022
Trade: type 4                          64  0.021
Trade: type 5                          49  0.016
Industry: type 8                       24  0.008
#####################################
#####################################
   TARGET  ratio
0  282686 91.927
1   24825  8.073
#####################################
#####################################
   FLAG_MOBIL   ratio
1      307510 100.000
0           1   0.000
#####################################
#####################################
   FLAG_EMP_PHONE  ratio
1          252125 81.989
0           55386 18.011
#####################################
#####################################
   FLAG_WORK_PHONE  ratio
0           246203 80.063
1            61308 19.937
#####################################
#####################################
   FLAG_CONT_MOBILE  ratio
1            306937 99.813
0               574  0.187
#####################################
#####################################
   FLAG_PHONE  ratio
0      221080 71.893
1       86431 28.107
#####################################
#####################################
   FLAG_EMAIL  ratio
0      290069 94.328
1       17442  5.672
#####################################
#####################################
   REGION_RATING_CLIENT  ratio
2                226984 73.813
3                 48330 15.717
1                 32197 10.470
#####################################
#####################################
   REGION_RATING_CLIENT_W_CITY  ratio
2                       229484 74.626
3                        43860 14.263
1                        34167 11.111
#####################################
#####################################
   REG_REGION_NOT_LIVE_REGION  ratio
0                      302854 98.486
1                        4657  1.514
#####################################
#####################################
   REG_REGION_NOT_WORK_REGION  ratio
0                      291899 94.923
1                       15612  5.077
#####################################
#####################################
   LIVE_REGION_NOT_WORK_REGION  ratio
0                       295008 95.934
1                        12503  4.066
#####################################
#####################################
   REG_CITY_NOT_LIVE_CITY  ratio
0                  283472 92.183
1                   24039  7.817
#####################################
#####################################
   REG_CITY_NOT_WORK_CITY  ratio
0                  236644 76.955
1                   70867 23.045
#####################################
#####################################
   LIVE_CITY_NOT_WORK_CITY  ratio
0                   252296 82.045
1                    55215 17.955
#####################################
#####################################
        DEF_60_CNT_SOCIAL_CIRCLE  ratio
0.000                     280721 91.288
1.000                      21841  7.103
2.000                       3170  1.031
3.000                        598  0.194
4.000                        135  0.044
5.000                         20  0.007
6.000                          3  0.001
7.000                          1  0.000
24.000                         1  0.000
#####################################
#####################################
   FLAG_DOCUMENT_2  ratio
0           307498 99.996
1               13  0.004
#####################################
#####################################
   FLAG_DOCUMENT_3  ratio
1           218340 71.002
0            89171 28.998
#####################################
#####################################
   FLAG_DOCUMENT_4  ratio
0           307486 99.992
1               25  0.008
#####################################
#####################################
   FLAG_DOCUMENT_5  ratio
0           302863 98.489
1             4648  1.511
#####################################
#####################################
   FLAG_DOCUMENT_6  ratio
0           280433 91.194
1            27078  8.806
#####################################
#####################################
   FLAG_DOCUMENT_7  ratio
0           307452 99.981
1               59  0.019
#####################################
#####################################
   FLAG_DOCUMENT_8  ratio
0           282487 91.862
1            25024  8.138
#####################################
#####################################
   FLAG_DOCUMENT_9  ratio
0           306313 99.610
1             1198  0.390
#####################################
#####################################
   FLAG_DOCUMENT_10  ratio
0            307504 99.998
1                 7  0.002
#####################################
#####################################
   FLAG_DOCUMENT_11  ratio
0            306308 99.609
1              1203  0.391
#####################################
#####################################
   FLAG_DOCUMENT_12  ratio
0            307509 99.999
1                 2  0.001
#####################################
#####################################
   FLAG_DOCUMENT_13  ratio
0            306427 99.647
1              1084  0.353
#####################################
#####################################
   FLAG_DOCUMENT_14  ratio
0            306608 99.706
1               903  0.294
#####################################
#####################################
   FLAG_DOCUMENT_15  ratio
0            307139 99.879
1               372  0.121
#####################################
#####################################
   FLAG_DOCUMENT_16  ratio
0            304458 99.007
1              3053  0.993
#####################################
#####################################
   FLAG_DOCUMENT_17  ratio
0            307429 99.973
1                82  0.027
#####################################
#####################################
   FLAG_DOCUMENT_18  ratio
0            305011 99.187
1              2500  0.813
#####################################
#####################################
   FLAG_DOCUMENT_19  ratio
0            307328 99.940
1               183  0.060
#####################################
#####################################
   FLAG_DOCUMENT_20  ratio
0            307355 99.949
1               156  0.051
#####################################
#####################################
   FLAG_DOCUMENT_21  ratio
0            307408 99.967
1               103  0.033
#####################################
#####################################
       AMT_REQ_CREDIT_BUREAU_HOUR  ratio
0.000                      264366 85.970
1.000                        1560  0.507
2.000                          56  0.018
3.000                           9  0.003
4.000                           1  0.000
#####################################
#####################################
       AMT_REQ_CREDIT_BUREAU_DAY  ratio
0.000                     264503 86.014
1.000                       1292  0.420
2.000                        106  0.034
3.000                         45  0.015
4.000                         26  0.008
5.000                          9  0.003
6.000                          8  0.003
9.000                          2  0.001
8.000                          1  0.000
#####################################
#####################################
       AMT_REQ_CREDIT_BUREAU_WEEK  ratio
0.000                      257456 83.723
1.000                        8208  2.669
2.000                         199  0.065
3.000                          58  0.019
4.000                          34  0.011
6.000                          20  0.007
5.000                          10  0.003
8.000                           5  0.002
7.000                           2  0.001
#####################################

In [29]:
df.groupby("NAME_INCOME_TYPE")["TARGET"].mean()

NAME_INCOME_TYPE
Businessman            0.000
Commercial associate   0.075
Maternity leave        0.400
Pensioner              0.054
State servant          0.058
Student                0.000
Unemployed             0.364
Working                0.096
Name: TARGET, dtype: float64

In [30]:
def rare_analyser(dataframe,target,cat_cols):
    for col in cat_cols:
        print(col,":",len(dataframe[col].value_counts()))
        print(pd.DataFrame({"COUNT": dataframe[col].value_counts(),
                            "RATIO": dataframe[col].value_counts() / len(dataframe),
                            "TARGET": dataframe.groupby(col)[target].mean()
                            }),end="\n\n\n")

In [31]:
rare_analyser(df,"TARGET",cat_cols)

ORGANIZATION_TYPE : 58
                        COUNT  RATIO  TARGET
Advertising               429  0.001   0.082
Agriculture              2454  0.008   0.105
Bank                     2507  0.008   0.052
Business Entity Type 1   5984  0.019   0.081
Business Entity Type 2  10553  0.034   0.085
Business Entity Type 3  67992  0.221   0.093
Cleaning                  260  0.001   0.112
Construction             6721  0.022   0.117
Culture                   379  0.001   0.055
Electricity               950  0.003   0.066
Emergency                 560  0.002   0.071
Government              10404  0.034   0.070
Hotel                     966  0.003   0.064
Housing                  2958  0.010   0.079
Industry: type 1         1039  0.003   0.111
Industry: type 10         109  0.000   0.064
Industry: type 11        2704  0.009   0.087
Industry: type 12         369  0.001   0.038
Industry: type 13          67  0.000   0.134
Industry: type 2          458  0.001   0.072
Industry: type 3         3278  0.011   0.106
Industry: type 4          877  0.003   0.101
Industry: type 5          599  0.002   0.068
Industry: type 6          112  0.000   0.071
Industry: type 7         1307  0.004   0.080
Industry: type 8           24  0.000   0.125
Industry: type 9         3368  0.011   0.067
Insurance                 597  0.002   0.057
Kindergarten             6880  0.022   0.070
Legal Services            305  0.001   0.079
Medicine                11193  0.036   0.066
Military                 2634  0.009   0.051
Mobile                    317  0.001   0.091
Other                   16683  0.054   0.076
Police                   2341  0.008   0.050
Postal                   2157  0.007   0.084
Realtor                   396  0.001   0.106
Religion                   85  0.000   0.059
Restaurant               1811  0.006   0.117
School                   8893  0.029   0.059
Security                 3247  0.011   0.100
Security Ministries      1974  0.006   0.049
Self-employed           38412  0.125   0.102
Services                 1575  0.005   0.066
Telecom                   577  0.002   0.076
Trade: type 1             348  0.001   0.089
Trade: type 2            1900  0.006   0.070
Trade: type 3            3492  0.011   0.103
Trade: type 4              64  0.000   0.031
Trade: type 5              49  0.000   0.061
Trade: type 6             631  0.002   0.046
Trade: type 7            7831  0.025   0.094
Transport: type 1         201  0.001   0.045
Transport: type 2        2204  0.007   0.078
Transport: type 3        1187  0.004   0.158
Transport: type 4        5398  0.018   0.093
University               1327  0.004   0.049
XNA                     55374  0.180   0.054


TARGET : 2
    COUNT  RATIO  TARGET
0  282686  0.919   0.000
1   24825  0.081   1.000


FLAG_MOBIL : 2
    COUNT  RATIO  TARGET
0       1  0.000   0.000
1  307510  1.000   0.081


FLAG_EMP_PHONE : 2
    COUNT  RATIO  TARGET
0   55386  0.180   0.054
1  252125  0.820   0.087


FLAG_WORK_PHONE : 2
    COUNT  RATIO  TARGET
0  246203  0.801   0.077
1   61308  0.199   0.096


FLAG_CONT_MOBILE : 2
    COUNT  RATIO  TARGET
0     574  0.002   0.078
1  306937  0.998   0.081


FLAG_PHONE : 2
    COUNT  RATIO  TARGET
0  221080  0.719   0.085
1   86431  0.281   0.070


FLAG_EMAIL : 2
    COUNT  RATIO  TARGET
0  290069  0.943   0.081
1   17442  0.057   0.079


REGION_RATING_CLIENT : 3
    COUNT  RATIO  TARGET
1   32197  0.105   0.048
2  226984  0.738   0.079
3   48330  0.157   0.111


REGION_RATING_CLIENT_W_CITY : 3
    COUNT  RATIO  TARGET
1   34167  0.111   0.048
2  229484  0.746   0.079
3   43860  0.143   0.114


REG_REGION_NOT_LIVE_REGION : 2
    COUNT  RATIO  TARGET
0  302854  0.985   0.081
1    4657  0.015   0.093


REG_REGION_NOT_WORK_REGION : 2
    COUNT  RATIO  TARGET
0  291899  0.949   0.080
1   15612  0.051   0.089


LIVE_REGION_NOT_WORK_REGION : 2
    COUNT  RATIO  TARGET
0  295008  0.959   0.081
1   12503  0.041   0.084


REG_CITY_NOT_LIVE_CITY : 2
    COUNT  RATIO  TARGET
0  283472  0.922   0.077
1   24039  0.078   0.122


REG_CITY_NOT_WORK_CITY : 2
    COUNT  RATIO  TARGET
0  236644  0.770   0.073
1   70867  0.230   0.106


LIVE_CITY_NOT_WORK_CITY : 2
    COUNT  RATIO  TARGET
0  252296  0.820   0.077
1   55215  0.180   0.100


DEF_60_CNT_SOCIAL_CIRCLE : 9
         COUNT  RATIO  TARGET
0.000   280721  0.913   0.078
1.000    21841  0.071   0.105
2.000     3170  0.010   0.121
3.000      598  0.002   0.159
4.000      135  0.000   0.111
5.000       20  0.000   0.150
6.000        3  0.000   0.000
7.000        1  0.000   0.000
24.000       1  0.000   0.000


FLAG_DOCUMENT_2 : 2
    COUNT  RATIO  TARGET
0  307498  1.000   0.081
1      13  0.000   0.308


FLAG_DOCUMENT_3 : 2
    COUNT  RATIO  TARGET
0   89171  0.290   0.062
1  218340  0.710   0.088


FLAG_DOCUMENT_4 : 2
    COUNT  RATIO  TARGET
0  307486  1.000   0.081
1      25  0.000   0.000


FLAG_DOCUMENT_5 : 2
    COUNT  RATIO  TARGET
0  302863  0.985   0.081
1    4648  0.015   0.080


FLAG_DOCUMENT_6 : 2
    COUNT  RATIO  TARGET
0  280433  0.912   0.083
1   27078  0.088   0.056


FLAG_DOCUMENT_7 : 2
    COUNT  RATIO  TARGET
0  307452  1.000   0.081
1      59  0.000   0.051


FLAG_DOCUMENT_8 : 2
    COUNT  RATIO  TARGET
0  282487  0.919   0.081
1   25024  0.081   0.073


FLAG_DOCUMENT_9 : 2
    COUNT  RATIO  TARGET
0  306313  0.996   0.081
1    1198  0.004   0.062


FLAG_DOCUMENT_10 : 2
    COUNT  RATIO  TARGET
0  307504  1.000   0.081
1       7  0.000   0.000


FLAG_DOCUMENT_11 : 2
    COUNT  RATIO  TARGET
0  306308  0.996   0.081
1    1203  0.004   0.062


FLAG_DOCUMENT_12 : 2
    COUNT  RATIO  TARGET
0  307509  1.000   0.081
1       2  0.000   0.000


FLAG_DOCUMENT_13 : 2
    COUNT  RATIO  TARGET
0  306427  0.996   0.081
1    1084  0.004   0.028


FLAG_DOCUMENT_14 : 2
    COUNT  RATIO  TARGET
0  306608  0.997   0.081
1     903  0.003   0.033


FLAG_DOCUMENT_15 : 2
    COUNT  RATIO  TARGET
0  307139  0.999   0.081
1     372  0.001   0.030


FLAG_DOCUMENT_16 : 2
    COUNT  RATIO  TARGET
0  304458  0.990   0.081
1    3053  0.010   0.049


FLAG_DOCUMENT_17 : 2
    COUNT  RATIO  TARGET
0  307429  1.000   0.081
1      82  0.000   0.024


FLAG_DOCUMENT_18 : 2
    COUNT  RATIO  TARGET
0  305011  0.992   0.081
1    2500  0.008   0.057


FLAG_DOCUMENT_19 : 2
    COUNT  RATIO  TARGET
0  307328  0.999   0.081
1     183  0.001   0.066


FLAG_DOCUMENT_20 : 2
    COUNT  RATIO  TARGET
0  307355  0.999   0.081
1     156  0.001   0.083


FLAG_DOCUMENT_21 : 2
    COUNT  RATIO  TARGET
0  307408  1.000   0.081
1     103  0.000   0.136


AMT_REQ_CREDIT_BUREAU_HOUR : 5
        COUNT  RATIO  TARGET
0.000  264366  0.860   0.077
1.000    1560  0.005   0.080
2.000      56  0.000   0.107
3.000       9  0.000   0.000
4.000       1  0.000   0.000


AMT_REQ_CREDIT_BUREAU_DAY : 9
        COUNT  RATIO  TARGET
0.000  264503  0.860   0.077
1.000    1292  0.004   0.097
2.000     106  0.000   0.104
3.000      45  0.000   0.044
4.000      26  0.000   0.115
5.000       9  0.000   0.000
6.000       8  0.000   0.000
8.000       1  0.000   0.000
9.000       2  0.000   0.000


AMT_REQ_CREDIT_BUREAU_WEEK : 9
        COUNT  RATIO  TARGET
0.000  257456  0.837   0.077
1.000    8208  0.027   0.078
2.000     199  0.001   0.101
3.000      58  0.000   0.069
4.000      34  0.000   0.118
5.000      10  0.000   0.100
6.000      20  0.000   0.050
7.000       2  0.000   0.000
8.000       5  0.000   0.000

In [32]:
def rare_encoder(dataframe,rare_perc):
    tempt_df=dataframe.copy()
    rare_columns = [col for col in tempt_df.columns if tempt_df[col].dtype == "o"
     and (temp_df[col].value_counts()/len(tempt_def) < rare_perc).any(axis=None)]
    for var in rare_columns:
        tmp = tempt_df[var].value_counts() / len(tempt_df)
        rare_labels = tmp[tmp<rare_perc].index
        tempt_df[var] = np.where(tempt_df[var].isin(rare_labels),'Rare',tempt_df[var])
        return tempt_df

### Standard Scaler

In [33]:
df = load()
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S

In [34]:
ss = StandardScaler()
df["Age_standard_Scaler"] = ss.fit_transform(df[["Age"]])

In [35]:
df.head()

   PassengerId  Survived  Pclass                                               Name     Sex    Age  SibSp  Parch            Ticket   Fare Cabin Embarked  Age_standard_Scaler
0            1         0       3                            Braund, Mr. Owen Harris    male 22.000      1      0         A/5 21171  7.250   NaN        S               -0.530
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female 38.000      1      0          PC 17599 71.283   C85        C                0.572
2            3         1       3                             Heikkinen, Miss. Laina  female 26.000      0      0  STON/O2. 3101282  7.925   NaN        S               -0.255
3            4         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female 35.000      1      0            113803 53.100  C123        S                0.365
4            5         0       3                           Allen, Mr. William Henry    male 35.000      0      0            373450  8.050   NaN        S                0.365

### RobustScaler

In [36]:
rs = RobustScaler()
df["Age_robust_Scaler"] = rs.fit_transform(df[["Age"]])
df.describe().T

                      count    mean     std    min     25%     50%     75%     max
PassengerId         891.000 446.000 257.354  1.000 223.500 446.000 668.500 891.000
Survived            891.000   0.384   0.487  0.000   0.000   0.000   1.000   1.000
Pclass              891.000   2.309   0.836  1.000   2.000   3.000   3.000   3.000
Age                 714.000  29.699  14.526  0.420  20.125  28.000  38.000  80.000
SibSp               891.000   0.523   1.103  0.000   0.000   0.000   1.000   8.000
Parch               891.000   0.382   0.806  0.000   0.000   0.000   0.000   6.000
Fare                891.000  32.204  49.693  0.000   7.910  14.454  31.000 512.329
Age_standard_Scaler 714.000   0.000   1.001 -2.017  -0.660  -0.117   0.572   3.465
Age_robust_Scaler   714.000   0.095   0.813 -1.543  -0.441   0.000   0.559   2.909

### MinMaxScaler

In [37]:
mms = MinMaxScaler()
df["Age_min_max_scaler"] = mms.fit_transform(df[["Age"]])
df.describe().T

                      count    mean     std    min     25%     50%     75%     max
PassengerId         891.000 446.000 257.354  1.000 223.500 446.000 668.500 891.000
Survived            891.000   0.384   0.487  0.000   0.000   0.000   1.000   1.000
Pclass              891.000   2.309   0.836  1.000   2.000   3.000   3.000   3.000
Age                 714.000  29.699  14.526  0.420  20.125  28.000  38.000  80.000
SibSp               891.000   0.523   1.103  0.000   0.000   0.000   1.000   8.000
Parch               891.000   0.382   0.806  0.000   0.000   0.000   0.000   6.000
Fare                891.000  32.204  49.693  0.000   7.910  14.454  31.000 512.329
Age_standard_Scaler 714.000   0.000   1.001 -2.017  -0.660  -0.117   0.572   3.465
Age_robust_Scaler   714.000   0.095   0.813 -1.543  -0.441   0.000   0.559   2.909
Age_min_max_scaler  714.000   0.368   0.183  0.000   0.248   0.347   0.472   1.000

## Numeric to Categorical

In [38]:
df["Age_cut"] = pd.qcut(df["Age"],5)